In [3]:
print('Hello World')

Hello World

In [9]:
tax = 12.5 / 100
price = 100.50
price * tax

12.5625

In [8]:
price +_ # lastly printed value is assigned to the variable _

414.5625

In [11]:
round (_, 3) # round off the value to the 3 decimal place

12.562

In [14]:
'doesn\'t'

"doesn't"

"doesn't"

In [15]:
'"Yes," they are'

'"Yes," they are'

In [1]:
"\"Yes,\" they are"

'"Yes," they are'

In [2]:
'"Isn\'t," they said.'

'"Isn\'t," they said.'

In [3]:
"Keshav\nBhandari"

'Keshav\nBhandari'

In [4]:
print("Keshav\nBhandari") # print() only can identify line break

Keshav
Bhandari

In [5]:
print("C:\name\imksav")

C:
ame\imksav

In [6]:
print(r"C:\name\imksav") # r should be used before the string starts to print the raw string

C:\name\imksav

In [7]:
print("""
This is multiple line printing.
S.N.  Name                Age
1.    Keshav Bhandari     25
2.    Sadikshya Poudel    13
""")

This is multiple line printing.
S.N.  Name                Age
1.    Keshav Bhandari     25
2.    Sadikshya Poudel    13

In [8]:
print("""\
This is multiple line printing.
S.N.  Name                Age
1.    Keshav Bhandari     25
2.    Sadikshya Poudel    13
""")

This is multiple line printing.
S.N.  Name                Age
1.    Keshav Bhandari     25
2.    Sadikshya Poudel    13

In [10]:
# use of + and * to string
2*'he'+2*'hu'

'hehehuhu'

In [11]:
'im' 'ksav' # this can be used to break long lines in code

'imksav'

In [ ]:
# variable and string can't be concatenate

In [14]:
name = 'Sadikshya Poudel'
#counting for positive starts from 0 while 0 and -0 is same so negative counting starts from -1
name[2] # third element
name[-2] # second last element
name[2:5] #elements from third position to sixth

'dik'

In [24]:
word = 'Python'
word[0:]
print('J'+word[0:])
print('J'+word[1:])

JPython
Jython

# Lists in Python

In [37]:
squares = [1,4,9,16,25]
squares

[1, 4, 9, 16, 25]

### Indexing and Slicing is available in List

### Lists are mutable, i.e. values can be changed

In [38]:
squares += [36,49,65]
squares

[1, 4, 9, 16, 25, 36, 49, 65]

In [41]:
squares[7]=64
squares

[1, 4, 9, 16, 25, 36, 49, 64]

# Nested Lists

In [51]:
odd = [1,3,5,7,9]
even = [2,4,6,8,10]
number = [odd, even]
print(number)
print(number[1])
print(number[1][2])

[[1, 3, 5, 7, 9], [2, 4, 6, 8, 10]]
[2, 4, 6, 8, 10]
6

# First Steps Towards Programming

In [56]:
# fibonacci series
a, b = 0, 1
while a<50:
    print(a)
    a, b = b, a+b

0
1
1
2
3
5
8
13
21
34

# More Control Flow Tools

## if statements

In [2]:
x = int(input("Enter an integer number:"))
if x<0:
    print("Negative")
elif x>0:
    print("Positive")
else:
    print("Zero")

Enter an integer number:5
Positive

## for statements

In [2]:
users = {'keshav':'active', 'sadikshya':'active', 'reba':'inactive', 'amisha':'inactive', 'sofy':'active'}
users
for key, value in users.copy().items():
    if value == 'inactive':
        print(users[key])
        
active_users = {}
for key, value in users.items():
    if value == 'active':
        active_users[key] = value
active_users

inactive
inactive

{'keshav': 'active', 'sadikshya': 'active', 'sofy': 'active'}

## range function

In [5]:
for i in range(5):
    print(i)

0
1
2
3
4

In [7]:
list(range(5,10))

[5, 6, 7, 8, 9]

In [9]:
list(range(5,50,3))

[5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47]

In [12]:
letters = ['a', 'e', 'i', 'o', 'u']
for l in range(len(letters)):
    print(l, letters[l])

0 a
1 e
2 i
3 o
4 u

In [15]:
sum(range(100))
sum(range(5))

10

## break and continue

In [28]:
start = int(input("From which number you want prime numbers:"))
end = int(input("To which number you want prime numbers:"))
for i in range(start,end):
    for j in range(2,i):
        if i%j==0:
            print(i,'*',j,'=',i*j)
            break
    else:
        print(i, "is a prime number")

From which number you want prime numbers:2
To which number you want prime numbers:50
2 is a prime number
3 is a prime number
4 * 2 = 8
5 is a prime number
6 * 2 = 12
7 is a prime number
8 * 2 = 16
9 * 3 = 27
10 * 2 = 20
11 is a prime number
12 * 2 = 24
13 is a prime number
14 * 2 = 28
15 * 3 = 45
16 * 2 = 32
17 is a prime number
18 * 2 = 36
19 is a prime number
20 * 2 = 40
21 * 3 = 63
22 * 2 = 44
23 is a prime number
24 * 2 = 48
25 * 5 = 125
26 * 2 = 52
27 * 3 = 81
28 * 2 = 56
29 is a prime number
30 * 2 = 60
31 is a prime number
32 * 2 = 64
33 * 3 = 99
34 * 2 = 68
35 * 5 = 175
36 * 2 = 72
37 is a prime number
38 * 2 = 76
39 * 3 = 117
40 * 2 = 80
41 is a prime number
42 * 2 = 84
43 is a prime number
44 * 2 = 88
45 * 3 = 135
46 * 2 = 92
47 is a prime number
48 * 2 = 96
49 * 7 = 343

In [2]:
for num in range(2, 10):
    if num % 2 == 0:
        print("Found an even number", num)
        continue
    print("Found an odd number", num)

Found an even number 2
Found an odd number 3
Found an even number 4
Found an odd number 5
Found an even number 6
Found an odd number 7
Found an even number 8
Found an odd number 9

## Function define

In [6]:
def ask_ok(prompt, retries=4, reminder='Please try again!'):
    while True:
        reply = input(prompt)
        if reply in {'y', 'ye', 'yes'}:
            return True
        if reply in {'n', 'no', 'nop', 'nope'}:
            return False
        retries = retries - 1
        if retries < 0:
            raise ValueError('invalid user response')
        print(reminder)

In [12]:
ask_ok("Do you want to quit?", 2)

Do you want to quit?n

False

## Keyword Arguments

In [13]:
def parrot(voltage, state='a stiff', action='voom', type='Norwegian Blue'):
    print("-- This parrot wouldn't", action, end=' ')
    print("if you put", voltage, "volts through it.")
    print("-- Lovely plumage, the", type)
    print("-- It's", state, "!")

In [15]:
parrot(1000)                                          # 1 positional argument
parrot(voltage=1000)                                  # 1 keyword argument
parrot(voltage=1000000, action='VOOOOOM')             # 2 keyword arguments
parrot(action='VOOOOOM', voltage=1000000)             # 2 keyword arguments
parrot('a million', 'bereft of life', 'jump')         # 3 positional arguments
parrot('a thousand', state='pushing up the daisies')  # 1 positional, 1 keyword

-- This parrot wouldn't voom if you put 1000 volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's a stiff !
-- This parrot wouldn't voom if you put 1000 volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's a stiff !
-- This parrot wouldn't VOOOOOM if you put 1000000 volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's a stiff !
-- This parrot wouldn't VOOOOOM if you put 1000000 volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's a stiff !
-- This parrot wouldn't jump if you put a million volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's bereft of life !
-- This parrot wouldn't voom if you put a thousand volts through it.
-- Lovely plumage, the Norwegian Blue
-- It's pushing up the daisies !

In [16]:
parrot()                     # required argument missing
parrot(voltage=5.0, 'dead')  # non-keyword argument after a keyword argument
parrot(110, voltage=220)     # duplicate value for the same argument
parrot(actor='John Cleese')  # unknown keyword argument

SyntaxError: positional argument follows keyword argument (3425694748.py, line 2)

In [22]:
def cheeseshop(kind, *arguments, **keywords):
    print("-- Do you have any", kind, "?")
    for arg in arguments:
        print(arg)
    print("-" * 40)
    for kw in keywords:
        print(kw, ":", keywords[kw])

In [23]:
cheeseshop("Limburger", "One",
           "Two",
           "Three",
           shopkeeper="Michael Palin",
           client="John Cleese",
           sketch="Cheese Shop Sketch")

-- Do you have any Limburger ?
One
Two
Three
----------------------------------------
shopkeeper : Michael Palin
client : John Cleese
sketch : Cheese Shop Sketch

In [25]:
def parrot(voltage, state='a stiff', action='voom'):
    print("-- This parrot wouldn't", action, end=' ')
    print("if you put", voltage, "volts through it.", end=' ')
    print("E's", state, "!")

d = {"voltage": "four million", "state": "bleedin' demised", "action": "VOOM"} # as keywords, dict can be passed
parrot(**d)

-- This parrot wouldn't VOOM if you put four million volts through it. E's bleedin' demised !

In [25]:
vec = [-4, -2, 0, 2, 4]
for x in vec:
    if x>=0:
       print(x)
    else:
        print("Not")

Not
Not
0
2
4

In [44]:
matrix = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
]
for i in range(4):
    for row in matrix:
        print(row[i])

1
5
9
2
6
10
3
7
11
4
8
12

In [65]:
yes_votes = 42_572_654
no_votes = 43_132_495
percentage = yes_votes / (yes_votes + no_votes)
'{:-8} YES votes  {:2.3%}'.format(yes_votes, percentage)

'42572654 YES votes  49.673%'

In [70]:
table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678}
for name, phone in table.items():
    print(f'{name:10} ==> {phone:10d}') # it is used to set the columns perfectly as it provides spaces

Sjoerd     ==>       4127
Jack       ==>       4098
Dcab       ==>       7678

In [75]:
animals = 'eels'
print(f'My hovercraft is full of {animals!r}.') # it gives the result as it is assigned with type

My hovercraft is full of 'eels'.

# Classes

## Classes and Objects

### Class and Object
1. Define a class named Rectangle that has attributes length and width. Write a method to calculate the area of the rectangle. Instantiate an object and print the area.

2. Create a class Employee with attributes name and salary. Write a method to give a raise to the employee by a certain percentage. Instantiate an object, give the employee a raise, and print the updated salary.

### Class Attributes and Instance Attributes
3. Define a class Car with a class attribute number_of_wheels set to 4. The class should also have instance attributes make and model. Create two instances of the class and print the number_of_wheels, make, and model for both instances.

### Methods
4. Create a class Student with attributes name and grades (a list). Write methods to add a grade and to calculate the average grade. Instantiate an object, add some grades, and print the average grade.

5. Define a class BankAccount with attributes owner and balance. Write methods to deposit money, withdraw money, and check the balance. Instantiate an object and perform some transactions, printing the balance after each transaction.

### Inheritance
6. Create a base class Animal with a method speak. Create two derived classes Dog and Cat that inherit from Animal and override the speak method to return "Woof" and "Meow" respectively. Instantiate objects of both classes and call the speak method on them.

7. Define a class Vehicle with attributes make and model, and a method drive that prints "Driving the vehicle". Create a derived class Truck that adds an attribute load_capacity and overrides the drive method to print "Driving the truck". Instantiate an object of Truck and call the drive method.

### Polymorphism
8. Create a function make_animal_speak that takes an object of type Animal and calls its speak method. Demonstrate polymorphism by passing instances of Dog and Cat to this function and printing the results.

### Encapsulation
9. Write a class Account with private attributes account_number and balance. Provide methods to get the account number, deposit money, and get the balance. Prevent direct access to the balance attribute.

### Exception Handling
10. Write a function divide_numbers that takes two numbers and returns their division. Use exception handling to catch and handle a division by zero error, printing an appropriate message if such an error occurs.

11. Create a class FileHandler with methods to read from and write to a file. Use exception handling to manage cases where the file might not exist or the user does not have permission to read/write the file.

In [109]:
class Rectangle:
    
    def __init__(self, length, width):
        self.length = length
        self.width = width
    
    def calculate_area(self):
        return self.length*self.width
    
    def area(l, w):
        return l*w
        
r = Rectangle(2,3)
print(r.calculate_area())

6

In [132]:
class Employee:
    
    def __init__(self, name, salary):
        self.name = name
        self.salary = salary
    
    def raised(self, per):
        return "{0} salary was {1} which increased by {2}% and receive {3} now.".format(self.name, self.salary, per, self.salary+per/100*self.salary)
    
e = Employee("Keshav", 270)
print(e.raised(10))
print(e.salary)

Keshav salary was 270 which increased by 10% and receive 297.0 now.
270

In [138]:
class Car:
    number_of_wheels = 4
    
    def __init__(self, make, model):
        self.make = make
        self.model = model
        
car1 = Car("Toyota", "Don")
car2 = Car("Honda", "Son")
print("Car 1:", car1.make, car1.model, car1.number_of_wheels)
print("Car 2:", car2.make, car2.model, car2.number_of_wheels)

Car 1: Toyota Don 4
Car 2: Honda Son 4

In [158]:
class Student:
    def __init__(self, name):
        self.name = name
        self.grades = []
    
    def add_grade(self, grade):
        self.grades.append(grade)
    
    def average_grade(self):
        average = sum(self.grades)/len(self.grades)
        return average

s = Student("Keshav")

s.add_grade(65)
s.add_grade(75)
s.add_grade(85)
s.add_grade(95)
s.add_grade(99)
print(s.average_grade())

83.8

In [196]:
class BankAccount:
    def __init__(self, owner, balance=0):
        self.owner = owner
        self.balance = balance
    
    def display(self):
        return "{0} have balance: {1}".format(self.owner, self.balance)
    
    def deposit(self, balance):
        self.balance += balance
        return "Balance after deposit is {0}".format(self.balance)
    
    def withdraw(self, balance):
        if balance > self.balance:
            return "Insufficinet balance"
        self.balance -= balance
        return "Balance after withdraw is {0}".format(self.balance)
    
    

b = BankAccount("Keshav", 500)
print(b.display())
print(b.deposit(200))
print(b.withdraw(100))
print(b.withdraw(100))
print(b.withdraw(500))
print(b.withdraw(100))
print(b.deposit(200))

Keshav have balance: 500
Balance after deposit is 700
Balance after withdraw is 600
Balance after withdraw is 500
Balance after withdraw is 0
Insufficinet balance
Balance after deposit is 200

In [219]:
class Animal:
    def speak(self):
        pass
        
class Dog(Animal):
    def speak(self):
        return "Woof"

class Cat:
    def speak(self):
        return "Meow"

dog = Dog()
cat = Cat()
print(dog.speak())
print(cat.speak())

Woof
Meow

In [233]:
class Vehicle:
    def __init__(self, make, model):
        self.make=make
        self.model=model
    
    def drive(self):
        return "Driving the vehicle"
    
class Truck(Vehicle):
    def __init__(self, make, model, load_capacity):
        super().__init__(make, model)
        self.load_capacity=load_capacity
    
    def drive(self):
        return "Driving the truck"

t = Truck("Honda", "New-1", 500)
an example of polymorphism - the function can take any object that has a speak method, and it doesn’t care what class the object is an instance of.t.drive()
# v = Vehicle("Ford", "Ford-1")
# v.drive()

'Driving the truck'

In [286]:
# an example of polymorphism:
# the function can take any object that has a speak method,
# and it doesn’t care what class the object is an instance of.

class Animal:
    pass
#     def __init__(self):
#         pass
    
def make_animal_speak(animal):
    return animal.speak()
    
class Dog(Animal):
    def speak(self):
        return "Dog Speaking"

class Cat(Animal):
    def speak(self):
        return "Cat Speaking"

dog = Dog()
cat = Cat()
make_animal_speak(dog)
make_animal_speak(cat)

'Cat Speaking'

In [308]:
class Account:
    def __init__(self, acc_num, blnc):
        self.__account_number = acc_num
        self.__balance = blnc
        
    def get_acc_details(self):
        return "Account Number: {0} has balance of {1}".format(self.__account_number, self.__balance)
    
    def deposit(self, blnc):
        self.__balance += blnc
        return self.__balance
    
    def withdraw(self, blnc):
        if blnc > self.__balance:
            return "Insufficient balance"
        self.__balance -= blnc
        return self.__balance
    

a1 = Account("A0000", 500)
a1.get_acc_details()
a1.deposit(200)
a1.withdraw(700)
a1.withdraw(100)
a1.deposit(200)
a1.get_acc_details()

'Account Number: A0000 has balance of 200'

In [321]:
def divide_numbers(a, b):
    try:
        result = a/b
        return result
    except ZeroDivisionError:
        return "Cannot divide by zero"
    
print(divide_numbers(5,2))
print(divide_numbers(5,0))

2.5
Cannot divide by zero

In [372]:
class FileHandler:
    def read_file(self, file_path):
        try:
            with open(file_path, 'r') as file:
                return file.read()
        except FileNotFoundError:
            print("File not exist")
        except PermissionError:
            print("Not permitted")
    
    def write_file(self, file_path, data):
        try:
            with open(file_path, 'a') as file:
                return file.write(data)
        except FileNotFoundError:
            print("File not exist to write")
        except PermissionError:
            print("Not permitted")

fh = FileHandler()
fh.write_file("me.txt", "Keshav-1\n")
print(fh.read_file("me.txt"))

Keshav-1
Keshav-1
Keshav-1

# Lambda, Map and Filter functions

In [392]:
# Write a lambda function that multiplies two numbers and use it to multiply 6 by 7.
# Write a lambda function that returns the square of a number and use it to square the number 5.

multiply = lambda x, y: x * y
print(multiply(6, 7))

squared = lambda x: x**2
print(squared(5))

# Given a list of numbers [1, 2, 3, 4, 5], use map() to create a new list with each number doubled.
# Use map() to convert a list of strings to uppercase. Example input: ['hello', 'world'].

numbers = [1,2,3,4,5]
doubled = list(map(lambda x: x*2, numbers))
print(doubled)

strings = ['hello', 'world']
upper_case = list(map(lambda x: x.upper(), strings))
print(upper_case)

# Given a list of numbers [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], use filter() to create a new list with only the odd numbers.
# Use filter() to extract words from a list that are longer than 4 characters. Example input: ['apple', 'banana', 'cherry', 'date'].

numbers = [1,2,3,4,5,6,7,8,9,10]
odd = list(filter(lambda x: x%2==1, numbers))
print(odd)

strings = ['apple', 'banana', 'cherry', 'date']
four = list(filter(lambda x: len(x)>4, strings))
print(four)

42
25
[2, 4, 6, 8, 10]
['HELLO', 'WORLD']
[1, 3, 5, 7, 9]
['apple', 'banana', 'cherry']

# SQL in Python

In [2]:
import sqlite3

# Connect to SQLite database
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Create table
c.execute('''CREATE TABLE IF NOT EXISTS students
             (id INTEGER PRIMARY KEY, name TEXT, age INTEGER)''')

# Commit and close
conn.commit()
conn.close()

In [397]:
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Insert data
c.execute("INSERT INTO students (name, age) VALUES ('Alice', 21)")
c.execute("INSERT INTO students (name, age) VALUES ('Bob', 22)")

# Commit and close
conn.commit()
conn.close()

In [399]:
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Retrieve data
c.execute("SELECT * FROM students")
rows = c.fetchall()
for row in rows:
    print(row)

# Close connection
conn.close()

(1, 'Alice', 21)
(2, 'Bob', 22)
(3, 'Alice', 21)
(4, 'Bob', 22)

In [3]:
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Update data
c.execute("UPDATE students SET age = 23 WHERE name = 'Alice'")

# Commit and close
conn.commit()
conn.close()

In [4]:
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Delete data
c.execute("DELETE FROM students WHERE name = 'Bob'")

# Commit and close
conn.commit()
conn.close()

In [6]:
conn = sqlite3.connect('example.db')
c = conn.cursor()

# Filter data
c.execute("SELECT * FROM students WHERE age > 21")
rows = c.fetchall()
for row in rows:
    print(row)

# Close connection
conn.close()

(1, 'Alice', 23)
(3, 'Alice', 23)

# Introduction to Pandas

In [4]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd
# create a simple dataframe
data = {
    'Name': ['Keshav', 'Sadikshya', 'Sofy', 'Bishal', 'Gokul', 'Shyam', 'Puru', 'Selu'],
    'Age': [25,13,13,24,28,27,34,12],
    'City': ['Butwal', 'Khotang', 'Kavre', 'Syangja', 'Melamchi', 'Dhading', 'baglung', 'Taplejung'],
}
df = pd.DataFrame(data)
print(df)

# write dataframe to csv
df.to_csv('data.csv', index=False)

# read csv file
df = pd.read_csv('data.csv')
print(df.head(10))

        Name  Age       City
0     Keshav   25     Butwal
1  Sadikshya   13    Khotang
2       Sofy   13      Kavre
3     Bishal   24    Syangja
4      Gokul   28   Melamchi
5      Shyam   27    Dhading
6       Puru   34    baglung
7       Selu   12  Taplejung
        Name  Age       City
0     Keshav   25     Butwal
1  Sadikshya   13    Khotang
2       Sofy   13      Kavre
3     Bishal   24    Syangja
4      Gokul   28   Melamchi
5      Shyam   27    Dhading
6       Puru   34    baglung
7       Selu   12  Taplejung

In [7]:
names = df['Name']
names

0       Keshav
1    Sadikshya
2         Sofy
3       Bishal
4        Gokul
5        Shyam
6         Puru
7         Selu
Name: Name, dtype: object

In [8]:
young_people = df[df['Age']<26]
young_people

        Name  Age       City
0     Keshav   25     Butwal
1  Sadikshya   13    Khotang
2       Sofy   13      Kavre
3     Bishal   24    Syangja
7       Selu   12  Taplejung

In [9]:
# where name matches data of that row changes
df.loc[df['Name']=='Sadikshya', 'Gender']='Female'
df

        Name  Age       City  Gender
0     Keshav   25     Butwal     nan
1  Sadikshya   13    Khotang  Female
2       Sofy   13      Kavre     nan
3     Bishal   24    Syangja     nan
4      Gokul   28   Melamchi     nan
5      Shyam   27    Dhading     nan
6       Puru   34    baglung     nan
7       Selu   12  Taplejung     nan

In [40]:
df.loc[df['Age']<20, 'Gender']='Female'
df

        Name  Age       City  Gender
0     Keshav   25     Butwal    Male
1  Sadikshya   13    Khotang  Female
2       Sofy   13      Kavre  Female
3     Bishal   24    Syangja    Male
4      Gokul   28   Melamchi    Male
5      Shyam   27    Dhading    Male
6       Puru   34    baglung    Male
7       Selu   12  Taplejung  Female

In [10]:
df['Role']=''
df
df.loc[df['Age']<20, 'Role'] = 'Student'
df
df.loc[df['Role']=='', 'Role'] = 'Teacher'
df

        Name  Age       City  Gender     Role
0     Keshav   25     Butwal     nan  Teacher
1  Sadikshya   13    Khotang  Female  Student
2       Sofy   13      Kavre     nan  Student
3     Bishal   24    Syangja     nan  Teacher
4      Gokul   28   Melamchi     nan  Teacher
5      Shyam   27    Dhading     nan  Teacher
6       Puru   34    baglung     nan  Teacher
7       Selu   12  Taplejung     nan  Student

In [11]:
df.describe()

             Age
count   8.000000
mean   22.000000
std     8.280787
min    12.000000
25%    13.000000
50%    24.500000
75%    27.250000
max    34.000000

In [12]:
sorted_df = df.sort_values(by="Age")
sorted_df

        Name  Age       City  Gender     Role
7       Selu   12  Taplejung     nan  Student
1  Sadikshya   13    Khotang  Female  Student
2       Sofy   13      Kavre     nan  Student
3     Bishal   24    Syangja     nan  Teacher
0     Keshav   25     Butwal     nan  Teacher
5      Shyam   27    Dhading     nan  Teacher
4      Gokul   28   Melamchi     nan  Teacher
6       Puru   34    baglung     nan  Teacher

In [19]:
data = {
    'Name': ['John', 'Jane', 'Alice', 'Bob'],
    'Age': [23, 35, 32, 28],
    'Salary': [50000, 80000, 65000, 60000]
}
df = pd.DataFrame(data)
# Change Alice's age to 33.
# Increase Bob's salary by 10%.

df.loc[df['Name']=='Alice', 'Age']='33'
df.loc[df['Name']=='Bob', 'Salary'] *= 1.1
df

C:\Users\imksa\AppData\Local\Temp\ipykernel_14340\3294567966.py:10: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '33' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[df['Name']=='Alice', 'Age']='33'

    Name Age  Salary
0   John  23   50000
1   Jane  35   80000
2  Alice  33   65000
3    Bob  28   66000